src/DataProcessors/d3_v4/d3_v4.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>d3_v4</name>
</mdclass:DataProcessor>

src/Catalogs/ИнформационныеБазыПорта/ИнформационныеБазыПорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазыПорта</name>
  <predefined>
    <items>
      <name>EDS</name>
      <description>EDS</description>
    </items>
    <items>
      <name>УПП</name>
      <description>УПП</description>
    </items>
    <items>
      <name>УКТ</name>
      <description>УКТ</description>
    </items>
    <items>
      <name>ВМКТ</name>
      <description>ВМКТ</description>
    </items>
    <items>
      <name>Скаут</name>
      <description>Скаут</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяТочкиПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗапроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутЗапросаКарточки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/d3_v4/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает статический снимок сцены V4 из макетов обработки.
//
// Возвращаемое значение:
//  Строка - JSON снимка сцены.
Функция ПолучитьСнимок() Экспорт

	ОбработкаОбъект = Создать();
	Возврат ОбработкаОбъект.ПолучитьСнимок();

КонецФункции

// Создаёт WS-прокси EDS по параметрам справочника ИнформационныеБазыПорта.
//
// Возвращаемое значение:
//  Структура:
//   * Сервис - WSПрокси, Неопределено -
//   * КодПроверки - Строка -
Функция ПолучитьWebСервисEDS() Экспорт

	Возврат ПолучитьWebСервисПоБазе(Справочники.ИнформационныеБазыПорта.EDS);

КонецФункции

// Создаёт WS-прокси УПП по параметрам справочника ИнформационныеБазыПорта.
//
// Возвращаемое значение:
//  Структура:
//   * Сервис - WSПрокси, Неопределено -
//   * КодПроверки - Строка -
Функция ПолучитьWebСервисУПП() Экспорт

	Возврат ПолучитьWebСервисПоБазе(Справочники.ИнформационныеБазыПорта.УПП);

КонецФункции

// Создаёт WS-прокси УКТ по параметрам справочника ИнформационныеБазыПорта.
//
// Возвращаемое значение:
//  Структура:
//   * Сервис - WSПрокси, Неопределено -
//   * КодПроверки - Строка -
Функция ПолучитьWebСервисУКТ() Экспорт

	Возврат ПолучитьWebСервисПоБазе(Справочники.ИнформационныеБазыПорта.УКТ);

КонецФункции

// Создаёт WS-прокси ВМКТ по параметрам справочника ИнформационныеБазыПорта.
//
// Возвращаемое значение:
//  Структура:
//   * Сервис - WSПрокси, Неопределено -
//   * КодПроверки - Строка -
Функция ПолучитьWebСервисВМКТ() Экспорт

	Возврат ПолучитьWebСервисПоБазе(Справочники.ИнформационныеБазыПорта.ВМКТ);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьWebСервисПоБазе(База)

	ПараметрыПодключения = Справочники.ИнформационныеБазыПорта.ПараметрыПодключения(База);
	ПроверитьПараметрыWebСервиса(ПараметрыПодключения, База);

	ПараметрыСервиса = Новый Структура;
	ПараметрыСервиса.Вставить("Сервис", Неопределено);
	ПараметрыСервиса.Вставить("КодПроверки", ПараметрыПодключения.КодПроверки);

	Таймаут = ПараметрыПодключения.ТаймаутЗапроса;
	Определение = Новый WSОпределения(
		ПараметрыПодключения.АдресWSDL,
		ПараметрыПодключения.ПользовательСервиса,
		ПараметрыПодключения.ПарольСервиса,
		Неопределено,
		Таймаут);
	Сервис = Новый WSПрокси(
		Определение,
		ПараметрыПодключения.URIПространстваИмен,
		ПараметрыПодключения.ИмяСервиса,
		ПараметрыПодключения.ИмяТочкиПодключения,
		Неопределено,
		Таймаут);
	Сервис.Пользователь = ПараметрыПодключения.ПользовательСервиса;
	Сервис.Пароль = ПараметрыПодключения.ПарольСервиса;

	ПараметрыСервиса.Сервис = Сервис;

	Возврат ПараметрыСервиса;

КонецФункции

Процедура ПроверитьПараметрыWebСервиса(ПараметрыПодключения, База)

	ОбязательныеПоля = СтрРазделить(
		"АдресWSDL,ПользовательСервиса,ПарольСервиса,URIПространстваИмен,ИмяСервиса,ИмяТочкиПодключения",
		",",
		Ложь);
	Для Каждого ИмяПоля Из ОбязательныеПоля Цикл
		Если Не ПустаяСтрока(СокрЛП(Строка(ПараметрыПодключения[ИмяПоля]))) Тогда
			Продолжить;
		КонецЕсли;
		ВызватьИсключение СтрШаблон(
			"Не заполнен реквизит ""%1"" элемента справочника ""Информационные базы порта"" (%2).",
			ИмяПоля,
			База);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
